# Explore San Francisco city employee salary data. This dataset can be found on kaggle: https://www.kaggle.com/datasets/kaggle/sf-salaries/data. Case-study:Exploratory Data Analysis

# import pandas: Python Data Analysis Library

In [2]:
import pandas as pd

# Read the file as dataframe

In [3]:
df=pd.read_csv(r'D:\Data_analysis_projects\Salaries.csv',low_memory=False)
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

# Check the head of the DataFrame

In [4]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [53]:
# How many entries there are?

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [6]:
df[df['BasePay'] == 'Not Provided']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148646,148647,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN

In [60]:
df.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [7]:
df2=df
df2[df2['BasePay'] == 'Not Provided']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148646,148647,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.0,0.0,2014,NaN,San Francisco,NaN

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

# Drop the lines with the value 'Not Provided'

In [9]:
df3 = df2.drop(df2[df2['BasePay'] == 'Not Provided'].index)

In [10]:
df3 = df2.drop(df2[df2['OvertimePay'] == 'Not Provided'].index)

In [11]:
df3 = df2.drop(df2[df2['OtherPay'] == 'Not Provided'].index)

In [12]:
df3 = df2.drop(df2[df2['Benefits'] == 'Not Provided'].index)

In [13]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 148650 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148650 non-null  int64
 1   EmployeeName      148650 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  object
 4   OvertimePay       148650 non-null  object
 5   OtherPay          148650 non-null  object
 6   Benefits          112491 non-null  object
 7   TotalPay          148650 non-null  float64
 8   TotalPayBenefits  148650 non-null  float64
 9   Year              148650 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148650 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 15.9+ MB

# Convert the data-type from object to float64

In [14]:
df3['BasePay']=df3['BasePay'].astype('float64')

In [15]:
df3['OvertimePay']=df3['OvertimePay'].astype('float64')

In [16]:
df3['OtherPay']=df3['OtherPay'].astype('float64')

In [17]:
df3['Benefits']=df3['Benefits'].astype('float64')

In [18]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 148650 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148650 non-null  int64
 1   EmployeeName      148650 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148650 non-null  float64
 8   TotalPayBenefits  148650 non-null  float64
 9   Year              148650 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148650 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 15.9+ MB

In [19]:
df3.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes
count,148650.000000,148045.000000,148650.000000,148650.000000,112491.000000,148650.000000,148650.000000,148650.000000,0.0
mean,74325.500047,66325.448840,5066.059886,3648.767297,25007.893151,74770.333901,93695.075969,2012.522603,NaN
std,42911.703176,42764.635495,11454.380559,8056.601866,15402.215858,50516.196009,62792.497391,1.117526,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN
25%,37163.250000,33588.200000,0.000000,0.000000,11535.395000,36169.955000,44073.337500,2012.000000,NaN
50%,74325.500000,65007.450000,0.000000,811.270000,28628.620000,71427.240000,92406.020000,2013.000000,NaN
75%,111487.750000,94691.050000,4658.175000,4236.065000,35566.855000,105842.960000,132877.992500,2014.000000,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN

In [20]:
df3['BasePay'] = pd.to_numeric(df3['BasePay'], errors='coerce')
df3['OtherPay'] = pd.to_numeric(df3['OtherPay'], errors='coerce')
df3['OvertimePay'] = pd.to_numeric(df3['OvertimePay'], errors='coerce')

In [21]:
df3.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes
count,148650.000000,148045.000000,148650.000000,148650.000000,112491.000000,148650.000000,148650.000000,148650.000000,0.0
mean,74325.500047,66325.448840,5066.059886,3648.767297,25007.893151,74770.333901,93695.075969,2012.522603,NaN
std,42911.703176,42764.635495,11454.380559,8056.601866,15402.215858,50516.196009,62792.497391,1.117526,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN
25%,37163.250000,33588.200000,0.000000,0.000000,11535.395000,36169.955000,44073.337500,2012.000000,NaN
50%,74325.500000,65007.450000,0.000000,811.270000,28628.620000,71427.240000,92406.020000,2013.000000,NaN
75%,111487.750000,94691.050000,4658.175000,4236.065000,35566.855000,105842.960000,132877.992500,2014.000000,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN

# what is the average BasePay

In [22]:
df3['BasePay'].mean()

66325.4488404877

# What is the highest amount of OvertimePay in the dataset

In [23]:
df3['OvertimePay'].max()

245131.88

In [93]:
# What is the job title of Joseph Driscoll ?

In [24]:
df3['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148645     Carolyn A Wilson
148647       Joann Anderson
148648          Leon Walker
148649        Roy I Tillery
148653            Joe Lopez
Name: EmployeeName, Length: 148650, dtype: object

In [25]:
df3['EmployeeName'] == 'Joseph driscoll'

0         False
1         False
2         False
3         False
4         False
          ...
148645    False
148647    False
148648    False
148649    False
148653    False
Name: EmployeeName, Length: 148650, dtype: bool

# What is the job title of joseph driscoll ?

In [100]:
df3[df3['EmployeeName'].str.lower() == 'joseph driscoll']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN
36198,36199,Joseph Driscoll,"Captain, Fire Suppression",145658.98,114513.29,28743.36,42919.16,288915.63,331834.79,2012,NaN,San Francisco,NaN

In [26]:
df3[df3['EmployeeName'].str.lower() == 'joseph driscoll']['JobTitle']

24       CAPTAIN, FIRE SUPPRESSION
36198    Captain, Fire Suppression
Name: JobTitle, dtype: object

# How much does joseph driscoll make including benefits ?

In [27]:
df3[df3['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

# What is the name of highest paid person

In [28]:
df3[df3['TotalPayBenefits'] == df3['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

# What is the name of lowest paid person

In [29]:
df3[df3['TotalPayBenefits'] == df3['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

# What is the average (mean) BasePay of all employees per year (2011-2014)

In [30]:
df3['Year'].unique()

array([2011, 2012, 2013, 2014], dtype=int64)

In [31]:
df3['BasePay'].mean()

66325.4488404877

In [33]:
df3.groupby('Year').mean('BasePay')

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Notes
Year,,,,,,,,
2011,18080.000000,63595.956517,4531.065429,3617.081926,NaN,71744.103871,71744.103871,NaN
2012,54542.500000,65436.406857,5023.417824,3653.437583,26439.966967,74113.262265,100553.229232,NaN
2013,91728.500000,69630.030216,5281.641980,3819.969007,23829.076572,77611.443142,101440.519714,NaN
2014,129591.000184,66564.421924,5401.993737,3505.421251,24789.601756,75471.836912,100261.438668,NaN

In [35]:
df3.groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [36]:
df3[['Year','BasePay']].groupby('Year').mean()

           BasePay
Year
2011  63595.956517
2012  65436.406857
2013  69630.030216
2014  66564.421924

# How many unique job titles are there

In [37]:
df3['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ...,
       'Forensic Toxicologist Supervis', 'Conversion', 'Cashier 3'],
      dtype=object)

In [38]:
df3['JobTitle'].nunique()

2158

# What are the top 5 most populare jobs ?

In [39]:
df3['JobTitle'].value_counts().head()

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

# How many job titles were represented by only one person in 2013

In [57]:
df3[df3['Year']==2013]['JobTitle']

72925                    Chief of Police
72926             Chief, Fire Department
72927     Battalion Chief, Fire Suppress
72928                  Asst Med Examiner
72929       Dep Dir for Investments, Ret
                       ...
110526           PS Aide Health Services
110527                      Senior Clerk
110528                  Police Officer 3
110529                  Police Officer 3
110530                  Police Officer 3
Name: JobTitle, Length: 37606, dtype: object

In [58]:
df3[df3['Year']==2013]['JobTitle'].value_counts()==1

JobTitle
Transit Operator                  False
Special Nurse                     False
Registered Nurse                  False
Public Svc Aide-Public Works      False
Custodian                         False
                                  ...
Sr General Utility Mechanic        True
Sprv Adult Prob Ofc (SFERS)        True
Mayoral Staff XII                  True
Pr Investigator, Tax Collector     True
Senior Assessment Clerk            True
Name: count, Length: 1051, dtype: bool

In [59]:
(df3[df3['Year']==2013]['JobTitle'].value_counts()==1).sum()

202

# How many people have the word chief in their job title?

In [60]:
df3['JobTitle'].apply()

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148645                         Human Services Technician
148647                       Communications Dispatcher 2
148648                                         Custodian
148649                                         Custodian
148653                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148650, dtype: object

In [62]:
def chief(string):
    if 'chief' in (string.lower()):
        return True
    else:
        return False

In [63]:
(df3['JobTitle'].apply(lambda x: chief(x)))

0         False
1         False
2         False
3         False
4          True
          ...
148645    False
148647    False
148648    False
148649    False
148653    False
Name: JobTitle, Length: 148650, dtype: bool

In [66]:
# En pandas, les valeurs boolÃ©ennes peuvent Ãªtre traitÃ©es comme des entiers oÃ¹ True Ã©quivaut Ã  1 et False Ã©quivaut Ã  0.
# La mÃ©thode .sum() additionne les valeurs de la sÃ©rie.
(df3['JobTitle'].apply(lambda x: chief(x))).sum()

627

# Bonnus: Is there a correlation between length of the job title and salary?

In [69]:
# return number of records
len(df3['JobTitle'])

148650

In [73]:
# return length of the job title
df3['ntitles']= df3['JobTitle'].apply(len)
df3['ntitles']

0         46
1         31
2         31
3         36
4         44
          ..
148645    25
148647    27
148648     9
148649     9
148653    26
Name: ntitles, Length: 148650, dtype: int64

In [76]:
df3[['ntitles','TotalPayBenefits']].corr()

                  ntitles  TotalPayBenefits
ntitles           1.00000          -0.03692
TotalPayBenefits -0.03692           1.00000

# There is no correlation between length of the job title and salary

In [78]:
# The correlation value will be a number between -1 and 1:
# A correlation of 1 implies a perfect positive relationship.
# A correlation of -1 implies a perfect negative relationship.
# A correlation of 0 implies no relationship.

# Interpretation of Correlation Coefficient
# -1 to -0.7: Strong negative correlation
# -0.7 to -0.3: Moderate negative correlation
# -0.3 to 0: Weak negative correlation
# 0: No correlation
# 0 to 0.3: Weak positive correlation
# 0.3 to 0.7: Moderate positive correlation
# 0.7 to 1: Strong positive correlation